
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Взаимозачеты Приход
	Движения.Взаимозачеты.Записывать = Истина;
	Движения.РегистрБухУчет.Записывать = Истина;
	Для Каждого ТекСтрокаПриход Из Приход Цикл
		Движение = Движения.Взаимозачеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаПриход.Контрагент;
		Движение.Сумма = ТекСтрокаПриход.Сумма;
		// регистр РегистрБухУчет 
		Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.РасчетныйСчет;
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.Покупатели;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаПриход.Сумма;

	КонецЦикла;

	// регистр Взаимозачеты Расход
	Движения.Взаимозачеты.Записывать = Истина;   
	Движения.РегистрБухУчет.Записывать = Истина;
	Для Каждого ТекСтрокаРасход Из Расход Цикл
		Движение = Движения.Взаимозачеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаРасход.Контрагент;
		Движение.Сумма = ТекСтрокаРасход.Сумма;
		// регистр РегистрБухУчет 
		Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.Поставщики;
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.РасчетныйСчет;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаРасход.Сумма;

	КонецЦикла;

	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
