Функция РозничнаяЦена(АктуальнаяДата, ЭлементНоменклатуры) Экспорт
	Отбор = Новый Структура("ТоварУслуга", ЭлементНоменклатуры);
	ЗначенияРесурсов = РегистрыСведений.УстановкаРозничныхЦен.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	Возврат ЗначенияРесурсов.Цена;
КонецФункции

Функция ЗакупочнаяЦена(АктуальнаяДата, ЭлементНоменклатуры) Экспорт
	Отбор = Новый Структура("ТоварУслуга", ЭлементНоменклатуры);
	ЗначенияРесурсов = РегистрыСведений.УстановкаЗакупочныхЦен.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	Возврат ЗначенияРесурсов.Цена;
КонецФункции
